app/views/pools/index.html.erb

  <% else %>
	<% @pools.select{|t| t.user == current_user}.each do |pool| %>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1