app/views/miners/index.html.erb

SELECT  "users".* FROM "users" INNER JOIN "joins" ON "users"."id" = "joins"."user_id" WHERE "joins"."miner_id" = ? LIMIT 1  [["miner_id", 1]]
---
	  <% else %>
		<% @miners.select{|t| t.user == current_user}.each do |miner| %>