app/controllers/miners_controller.rb

  def index
    @miners = Miner.all
---
SELECT "miners".* FROM "miners"

  def lease
    @miners = Miner.all
---
SELECT "miners".* FROM "miners"

  def new
    @miner = Miner.new
    @pools = Pool.all
    unless current_user.admin?
      @pools = @pools.select{|t| t.user == current_user}
---
SELECT "pools".* FROM "pools"
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1

  def edit
    @pools = Pool.all
    unless current_user.admin?
      @pools = @pools.select{|t| t.user == current_user}
---
SELECT "pools".* FROM "pools"
SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1

  def create
    @miner = Miner.new(miner_params)

#    @something = Pool.find(params[:user_id])
#on the page, define :user_id as current_user.id
#I guess, first, I should just try to display any pools

    respond_to do |format|
      if @miner.save
---
INSERT INTO "miners" ("created_at", "ip", "name", "pool_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-05-28 22:26:15.716157"], ["ip", "192.168.1.10"], ["name", "Serf1"], ["pool_id", 1], ["updated_at", "2014-05-28 22:26:15.716157"]]

  def update
    @pools = Pool.all
    unless current_user.admin?
      @pools = @pools.select{|t| t.user == current_user}
    end
    if current_user.admin?
      #do nothing
      @miner.update_attribute(:state, 0)
---
SELECT "pools".* FROM "pools"
SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1
UPDATE "miners" SET "pool_id" = ?, "updated_at" = ? WHERE "miners"."id" = 2  [["pool_id", 2], ["updated_at", "2014-05-28 22:32:35.509048"]]

    def set_miner
      @miner = Miner.find(params[:id])
---
SELECT  "miners".* FROM "miners"  WHERE "miners"."id" = ? LIMIT 1  [["id", 2]]