app/controllers/pools_controller.rb

SELECT "pools".* FROM "pools"
---
  def index
    @pools = Pool.all

INSERT INTO "pools" ("created_at", "ip", "password", "updated_at", "user_id", "user_name") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-05-28 22:25:51.141588"], ["ip", "us1.ghash.io:3333"], ["password", "x"], ["updated_at", "2014-05-28 22:25:51.141588"], ["user_id", 1], ["user_name", "NinjaPool"]]
---
  def create
    @pool = Pool.new(pool_params)
    @pool.user = current_user

    respond_to do |format|
      if @pool.save

UPDATE "pools" SET "password" = ?, "updated_at" = ?, "user_name" = ? WHERE "pools"."id" = 2  [["password", "x"], ["updated_at", "2014-05-28 22:32:03.029907"], ["user_name", "Levin's Moose Pool"]]
---
  def update
    respond_to do |format|
      if @pool.update(pool_params)

SELECT  "pools".* FROM "pools"  WHERE "pools"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_pool
      @pool = Pool.find(params[:id])